#Задание 1
num = [0, 0, 0, 0, 0]
for i in enumerate(num):
    print(i)

#Задание 2
# list = []
# for i in range(1,101):
#     list.append(i)
# print(list)

#Задание 3
# for i in range(1, 498):
#     if i % 2 == 0:
#         print(i)

#Задание 4
# listochek = []
# for i in range(1, 1001):
#     listochek.append(i)
# print(min(listochek), max(listochek), sum(listochek))

#Задание 5
# list = []
# for i in range(100):
#     list.append("0")
# print(list)

#Доп. задание 6
# variable_1 = input("Введите первое значение: ")
# variable_2 = input("Введите второе значение: ")
# print(variable_1, variable_2)
# variable_1, variable_2 = variable_2, variable_1
# print(variable_1, variable_2)

#Доп.задание 7
# while True:
#     age = int(input("Введите свой возраст: "))
#     if age < 18:
#         print("Извините, пользование данным ресурсом только с 18 лет")
#     else:
#         print("Доступ разрешен.")
#         break